app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1], ["id", 2], ["id", 4], ["id", 6], ["id", 9], ["id", 3]]
---
  def index
    @categories = current_user.categories.includes(:transactions)

INSERT INTO "categories" ("name", "user_id", "icon", "created_at", "updated_at", "icon_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @category = Category.new(category_params)
    @category.user_id = current_user.id

    if @category.save
      # Proverite da li postoje transakcije za dodavanje
      if params[:transactions_id].present?
        params[:transactions_id].each do |transaction_id|
          @category.transactions << Transaction.find(transaction_id)