app/controllers/transactions_controller.rb

  def index
    @category = Category.includes(:transactions).find(params[:category_id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def new
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @category = Category.find(params[:category_id])
    @transaction = @category.transactions.build(transaction_params.merge(author: current_user))

    if @transaction.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "transactions" ("name", "author_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "qwer"], ["author_id", 1], ["amount", "3.0"], ["created_at", "2023-06-06 11:09:46.767365"], ["updated_at", "2023-06-06 11:09:46.767365"]]
INSERT INTO "transaction_categories" ("transaction_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["transaction_id", 13], ["category_id", 16], ["created_at", "2023-06-06 11:28:05.622877"], ["updated_at", "2023-06-06 11:28:05.622877"]]