app/views/transactions/new.html.erb


<%= form.collection_select :transaction_record_id, Category.all, :id, :name, { prompt: 'Select category' } %>
---
SELECT "categories".* FROM "categories"